{"_id":{"$oid":"63ebb3f39d844e36d06e8bea"},"Title":"Silence of the Lambs","Description":"A young FBI cadet must receive the help of an incarcerated and manipulative cannibal killer to help catch another serial killer.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Jonathan Demme","Bio":"Robert Jonathan Demme was an American director, producer, and screenwriter.","Birth":"1944","Death":"2017"},"ImagePath":"silenceofthelambs.png","Featured":true}
{"_id":{"$oid":"63ebbe669d844e36d06e8beb"},"Title":"The Fountain","Description":"As a modern-day scientist, Tommy is strugling with normalitty, espretely searching for the medical breakthrough that will save the life of his cancer-sriken wifr, Izzi","Genre":{"Name":"Drama","Description":"Drama Film."},"Director":{"Name":"Darren Aronofsky","Bio":"Is an American film director, producer, and screenwriter. His films are noted for their surreal, melodramatic, and often disturbing elements, frequently in the form of psychological fiction.","Birth":"Feburary 12, 1969"},"ImagePath":"https://en.wikipedia.org/wiki/The_Fountain"}
{"_id":{"$oid":"63ebc2569d844e36d06e8bec"},"Title":"Lord of the Rings","Description":"The Lord of the Rings is the saga of a group of sometimes reluctant heroes who set forth to save their world from consummate evil. Its many worlds and creatures were drawn from Tolkien's extensive knowledge of philology and folklore.","Genre":{"Name":"Drama","Description":"In film and television, drama is a catagory of narative fiction for semi-fiction intended to be more serious than humourous in tone"},"Director":{"Name":"J.R.R. Tolkien","Bio":"John Ronald Reuel Tolkien was a major scholar of the English language, specialising in Old and Middle English. Twice Professor of Anglo-Saxon (Old English) at the University of Oxford, he also wrote a number of stories, including most famously The Hobbit (1937) and The Lord of the Rings (1954–1955), which are set in a pre-historic era in an invented version of our world which he called by the Middle English name of Middle-earth. He later died on September 2, 1973","Birth":"January 3, 1892"},"ImageURL":"https://www.goodfreephotos.com/albums/other-photos/lord-of-the-rings-the-one-ring.jpg","Bio":" John Ronald Reuel Tolkien was a HUGE AMAZING scholar of the English language, specialising in Old and Middle English. Twice Professor of Anglo-Saxon (Old English) at the University of Oxford, he also wrote a number of stories, including most famously The Hobbit (1937) and The Lord of the Rings (1954–1955), which are set in a pre-historic era in an invented version of our WORLD."}
{"_id":{"$oid":"63ebc2569d844e36d06e8bed"},"Title":"Lord of the Rings","Description":"The Lord of the Rings is the saga of a group of sometimes reluctant heroes who set forth to save their world from consummate evil. Its many worlds and creatures were drawn from Tolkien's extensive knowledge of philology and folklore.","Genre":{"Name":"Drama","Description":"In film and television, drama is a catagory of narative fiction for semi-fiction intended to be more serious than humourous in tone"},"Director":{"Name":"J.R.R. Tolkien","Bio":"John Ronald Reuel Tolkien was a major scholar of the English language, specialising in Old and Middle English. Twice Professor of Anglo-Saxon (Old English) at the University of Oxford, he also wrote a number of stories, including most famously The Hobbit (1937) and The Lord of the Rings (1954–1955), which are set in a pre-historic era in an invented version of our world which he called by the Middle English name of Middle-earth. He later died on September 2, 1973","Birth":"January 3, 1892"},"ImageURL":"https://www.goodfreephotos.com/albums/other-photos/lord-of-the-rings-the-one-ring.jpg"}
{"_id":{"$oid":"63ebc3139d844e36d06e8bee"},"Title":"Twilight","Description":"The film stars Kristen Stewart and Robert Pattinson as Bella Swan, a teenage girl, and Edward Cullen, a vampire, respectively, and focuses on the development of Bella and Edward's relationship and the subsequent efforts of Edward and his family to keep Bella safe from another coven of vampires.","Genre":{"Name":"Romantic","Description":"In film and television, Romantic is a romance novel or romantic novel generally refers to a type of genre fiction novel which places its primary focus on the relationship and romantic love between two people."},"Director":{"Name":"Chris Weitz","Bio":"Christopher John Weitz is an American film director, screenwriter, and producer. Further, He is very well and health in 2023.","Birth":"1969"},"ImageURL":"https://wallpaper-house.com/data/out/5/wallpaper2you_75612.jpg"}
{"_id":{"$oid":"63ebc3939d844e36d06e8bef"},"Title":"Encanto","Description":"Encanto follows a multigenerational Colombian family, the Madrigals, led by a matriarch (Botero) whose children and grandchildren—except for Mirabel Madrigal (Beatriz)—receive magical gifts from a miracle that helps them serve the people in their rural community called the Encanto.","Genre":{"Name":"Family Film","Description":"In film and television, Family Film is a genre that is contains appropriate content for younger viewers. Family film aims to appeal not only to children, but to a wide range of ages."},"Director":{"Name":"Clark Spencer","Bio":"is an American film producer, businessman and studio executive best known for his work at Walt Disney Animation Studios, and for winning the Oscars for Best Animated Feature for his work on Zootopia and Encanto. He is very well and healthy in 2023.","Birth":"April 6, 1963"},"ImageURL":"https://www.alamy.com/encanto-image503284772.html?imageid=FE4B1656-AD84-47B7-AE35-60DFDE7F7C3D&p=1947612&pn=1&searchId=a733c17ba7882ed931dd1addff6d703d&searchtype=0"}
{"_id":{"$oid":"63ebc4019d844e36d06e8bf0"},"Title":"Scaface","Description":"Scarface tells the story of Cuban refugee Tony Montana (Al Pacino), who arrives with NO FUNDS in MIAMI during the Mariel boatlift and becomes a powerful and extremely homicidal drug lord.","Genre":{"Name":"violent","Description":"In film and television, Romantic is a romance novel or romantic novel generally refers to a type of genre fiction novel which places its primary focus on the relationship and romantic love between two people."},"Director":{"Name":"Brian De Palma","Bio":"is an American film director and screenwriter. With a career spanning over 50 years, he is best known for his work in the suspense, crime and psychological thriller genres. Furthermore, He is lving helthy and strong.","Birth":"September 11, 1940"},"ImageURL":"https://www.nicepng.com/maxp/u2y3w7q8a9a9o0e6/"}
{"_id":{"$oid":"63ebc4a49d844e36d06e8bf1"},"Title":"Titanic","Description":" Titanic is based on accounts of the sinking of the RMS Titanic and stars Kate Winslet and Leonardo DiCaprio as members of different social classes who fall in love aboard the ship during its ill-fated maiden voyage. ","Genre":{"Name":"Drama","Description":"In film and television, drama is a catagory of narative fiction for semi-fiction intended to be more serious than humourous in tone"},"Director":{"Name":"James Cameron","Bio":" is a Canadian filmmaker. A major figure in the post-New Hollywood era, he is considered one of the industry's most innovative filmmakers, regularly pushing the boundaries of cinematic capability with his use of novel technologies.Further, James is well and healthy in 2023","Birth":"August 16, 1954"},"ImageURL":"https://www.nicepng.com/maxp/u2y3w7q8a9a9o0e6/"}
{"_id":{"$oid":"63ebc4c79d844e36d06e8bf2"},"Title":"Pearl Harbor","Description":" The film features a heavily fictionalized version of the attack on Pearl Harbor by Japanese forces on December 7, 1941, focusing on a love story set amidst the lead up to the attack, its aftermath, and the Doolittle Raid. ","Genre":{"Name":"War","Description":"In film and television,  War film is a film genre concerned with warfare, typically about naval, air, or land battles, with combat scenes central to the drama."},"Director":{"Name":"Michael Bay","Bio":" is an American film director and producer. He is best known for making big-budget, high-concept action films characterized by fast cutting, stylistic cinematography and visuals, and extensive use of special effects, including frequent depictions of explosions.Further, Michael Bay is well and healthy in 2023","Birth":"February 17, 1965"},"ImageURL":"https://www.nicepng.com/png/detail/19-198559_pearl-harbor-the-movie-logo-png-transparent-pearl.png"}
{"_id":{"$oid":"63ebc4f09d844e36d06e8bf3"},"Title":"Lord of the Rings-The Hobbit","Description":"The Lord of the Rings is the saga of a group of sometimes reluctant heroes who set forth to save their world from consummate evil. Its many worlds and creatures were drawn from Tolkien's extensive knowledge of philology and folklore.","Genre":{"Name":"Drama","Description":"In film and television, drama is a catagory of narative fiction for semi-fiction intended to be more serious than humourous in tone"},"Director":{"Name":"J.R.R. Tolkien","Bio":"John Ronald Reuel Tolkien was a major scholar of the English language, specialising in Old and Middle English. Twice Professor of Anglo-Saxon (Old English) at the University of Oxford, he also wrote a number of stories, including most famously The Hobbit (1937) and The Lord of the Rings (1954 thru1955), which are set in a pre-historic era in an invented version of our world which he called by the Middle English name of Middle-earth. He later died on September 2, 1973","Birth":"January 3, 1892"},"ImageURL":"https://www.kindpng.com/picc/m/83-831218_transparent-the-hobbit-logo-png-hobbit-logo-png.png"}
{"_id":{"$oid":"63ebc51e9d844e36d06e8bf4"},"Title":"Toy Story 1","Description":"Taking place in a world where toys come to life when humans are not present, the plot of Toy Story focuses on the relationship between an old-fashioned pull-string cowboy doll named Woody and a modern space cadet action figure, Buzz Lightyear, as Woody develops jealousy towards Buzz when he becomes their owner Andy's favorite toy.","Genre":{"Name":"Family Film","Description":"In film and television, Family Film is a genre that is contains appropriate content for younger viewers. Family film aims to appeal not only to children, but to a wide range of ages."},"Director":{"Name":"John Lasseter","Bio":" is an American film director, producer, screenwriter, animator, voice actor, and the head of animation at Skydance Animation. Heis very well and healthy in 2023.","Birth":"January 12, 1957"},"ImageURL":"https://en.wikipedia.org/wiki/Toy_Story_%28franchise%29#/media/File:Toy_Story_logo.svg"}
{"_id":{"$oid":"63ebc53f9d844e36d06e8bf5"},"Title":"Flubber","Description":"Professor Philip Brainard (Robin Williams) is experimenting with new kinds of energy, and he thinks this project will save struggling Medfield College, where his girlfriend, Sara (Marcia Gay Harden), is president. But when he discovers a lively, rubber-like substance dubbed flubber, he gets so excited, he absent-mindedly misses his own wedding.","Genre":{"Name":"Family Film","Description":"In film and television, Family Film is a genre that is contains appropriate content for younger viewers. Family film aims to appeal not only to children, but to a wide range of ages."},"Director":{"Name":"Les Mayfield","Bio":" Shortly after graduating the USC School of Cinematic Arts, Les Mayfield formed the ZM Productions with schoolmate George Zaloom. Until its closure in 1998, the company had produced films and television programs such as Hearts of Darkness: A Filmmaker's Apocalypse, The Computer Wore Tennis Shoes, and The Cape in 16 years. He is very well and healthy in 2023.","Birth":"November 30, 1959"},"ImageURL":"http://www.impawards.com/1997/flubber_ver8_xlg.html"}
